Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Check the https://grpc.github.io/grpc-java/javadoc/io/grpc/ClientInterceptor.html[ClientInterceptor JavaDoc] to properly implement your interceptor.
ja_jp: https://grpc.github.io/grpc-java/javadoc/io/grpc/ClientInterceptor.html[ClientInterceptor JavaDoc] をチェックして、インターセプターを適切に実装してください。

source: Check the https://grpc.github.io/grpc-java/javadoc/io/grpc/ServerInterceptor.html[ServerInterceptor JavaDoc] to properly implement your interceptor.
ja_jp: link:https://grpc.github.io/grpc-java/javadoc/io/grpc/ServerInterceptor.html[ServerInterceptor JavaDoc] をチェックして、インターセプターを適切に実装してください。

source: Check the https://smallrye.io/smallrye-stork[SmallRye Stork website] to find more about the provided service discovery and selection.
ja_jp: 提供されるサービスディスカバリーとセレクションについては、 link:https://smallrye.io/smallrye-stork[SmallRye Storkのウェブサイト]をご確認ください。

source: Check the https://vertx.io/docs/vertx-web/java/#_basic_vert_x_web_concepts[Vert.x Web documentation] to know more about the route registration, options, and available handlers.
ja_jp: ルート登録、オプション、および使用可能なハンドラーの詳細については、 https://vertx.io/docs/vertx-web/java/#_basic_vert_x_web_concepts[Vert.x Web ドキュメント] を確認してください。

source: Check the logs
ja_jp: ログの確認

source: Check the request path to create tenant configurations.
ja_jp: テナント設定を作成するためのリクエストパスを確認します。

source: Check the response `Content-Type` header.
ja_jp: レスポンスの `Content-Type` ヘッダーを確認します。

source: Check the server output to see that fallback is really happening:
ja_jp: フォールバックが本当に行われているかどうか、サーバーの出力を確認してください。 :

source: Check the size of the binary for differences. Using `readelf` you can observe the size of different sections and compare them. The `.text` section where code lives, and the `.svm_heap` section where heap produced at build time lives, are particularly interesting.
ja_jp: バイナリーのサイズに違いがないか確認する。 `readelf` を使って、異なるセクションのサイズを観察し、比較することができます。特に、コードが存在する `.text` セクションと、ビルド時に生成されるヒープが存在する `.svm_heap` セクションは興味深いです。

source: Check the xref:./virtual-threads.adoc#why-not[virtual thread reference guide] for details.
ja_jp: 詳しくは xref:./virtual-threads.adoc#why-not[仮想スレッドリファレンスガイド] をご確認ください。

source: Check the xref:config-mappings.adoc[Mapping configuration to objects] guide for advanced usages with `@ConfigMapping`.
ja_jp: `@ConfigMapping` を使用した高度な用法については、 xref:config-mappings.adoc[オブジェクトへの設定のマッピング] ガイドを確認してください。

source: Check the xref:infinispan-dev-services.adoc[Infinispan Dev Services Guide] to connect to the Infinispan Dev Services server.
ja_jp: xref:infinispan-dev-services.adoc[Infinispan Dev Servicesガイド] を確認し、Infinispan Dev Servicesサーバーに接続して下さい。

source: Check the xref:native-reports[native build time reports] and see if there are big discrepancies in the number of used packages, used classes or used methods. A bigger universe will result in bigger memory footprint.
ja_jp: xref:native-reports[ネイティブビルドタイムレポート] を確認し、使用パッケージ数、使用クラス数、使用メソッド数に大きな相違がないかを確認します。世界が広いと、メモリフットプリントが大きくなります。

source: Check the xref:vertx.adoc[Using Vert.x guide] for further details about these different APIs and how to select the most suitable for you.
ja_jp: 各APIの詳細および最適なAPIの選択方法については、 xref:vertx.adoc[Vert.x のガイド] をご参照ください。

source: Check they are processed successfully in the application log output:
ja_jp: 正常に処理されていることをアプリケーションログ出力で確認してください:

source: Check whether datasource beans are active before retrieving the corresponding session.
ja_jp: 対応するセッションを取得する前に、データソース Bean がアクティブか確認します。

source: Check whether there already is data in the index -- if not, bail out.
ja_jp: インデックスにすでにデータがあるか確認します。ない場合は終了します。

source: Check xref:jackson-serialization[Serializing via Jackson] for more detail about the usage of Jackson with Kafka. You can also use Avro.
ja_jp: JacksonとKafkaの使い方の詳細は、 xref:jackson-serialization[Jacksonでシリアライゼーション] をご確認ください。また、Avroを使用することもできます。

source: Check your extension is present in link:https://central.sonatype.com/[Maven Central]
ja_jp: エクステンションが link:https://central.sonatype.com/[Maven Central] に存在することを確認してください

source: Checking Permission Scopes Programmatically
ja_jp: プログラムによるパーミッションスコープのチェック

source: Checking Permissions Programmatically
ja_jp: プログラムで権限をチェックする

source: Checking errors in the logs
ja_jp: ログでのエラー確認

source: Checking permission scopes programmatically
ja_jp: プログラムを使用してパーミッションスコープを確認する

source: Checks if the application is prepared to serve the challenge.
ja_jp: アプリケーションがチャレンジに対応する準備ができているか確認します。

source: Checks if the call is insecure by checking if the request user/caller `Principal` against null.
ja_jp: リクエストのユーザー/呼び出し元の `Principal` を null と照合して、呼び出しが安全でないかどうかを確認します。

source: Cherry on top, all this work is done at build time and you don't need to scan your entire classpath at runtime.
ja_jp: さらに、これらの作業はすべてビルド時に行われるので、ランタイムにクラスパス全体をスキャンする必要はありません。

source: Chicory is an open-source, 100% native Java WebAssembly (Wasm) runtime.
ja_jp: Chicory は、オープンソースの 100% ネイティブ Java WebAssembly (Wasm) ランタイムです。

source: Chocolatey - for Windows
ja_jp: Chocolatey - Windows 向け

source: Choose Keycloak realm and client id which will be used during the authentication process.
ja_jp: 認証プロセスで使用されるKeycloakレルムとクライアントIDを選択します。

source: Choose Your Function
ja_jp: Cloud Functions の関数を選択する

source: Choose Your Lambda
ja_jp: 使用する Lambda の選択

source: Choose the JSON console log format by setting the configuration property:
ja_jp: 設定プロパティーを設定して、JSON コンソールログフォーマットを選択します。

source: Choose the Keycloak realm and client ID to use during the authentication process.
ja_jp: 認証プロセス中に使用する Keycloak レルムとクライアント ID を選択します。

source: Choosing between OpenID Connect, SmallRye JWT and OAuth2 extensions
ja_jp: OpenID Connect、SmallRye JWT、OAuth2エクステンションからの選択

source: Choosing between OpenID Connect, SmallRye JWT, and OAuth2 authentication mechanisms
ja_jp: OpenID Connect、SmallRye JWT、OAuth2 認証メカニズムからの選択

source: Choosing between eager and lazy initialization
ja_jp: Eager初期化とLazy初期化の選択

source: Choosing your build tool
ja_jp: ビルドツールの選択

source: Chunks are the primary unit of memory allocation in Netty's arenas.
ja_jp: チャンクは、Netty のアリーナにおけるメモリー割り当ての主要な単位です。

source: Cipher suites
ja_jp: 暗号スイート

source: Cipher suites and protocols are valid.
ja_jp: 暗号スイートとプロトコルが有効である。

source: Cipher suites are a list of ciphers that you can use during the TLS handshake. You can configure an ordered list of enabled cipher suites. If not configured, a reasonable default is selected from the built-in ciphers. However, when specified, your configuration precedes the default suite defined by the SSL engine in use.
ja_jp: 暗号スイートは、TLS ハンドシェイク中に使用できる暗号のリストです。 有効な暗号スイートの順序付きリストを設定できます。 設定されていない場合は、組み込みの暗号の中から適切なデフォルトが選択されます。 ただし、設定を指定すると、その設定が、使用中の SSL エンジンによって定義されているデフォルトスイートよりも優先されます。

source: Circuit Breaker
ja_jp: サーキットブレーカー

source: Circular dependencies in the dependency graph. Having circular dependencies is often an indication that a redesign should be considered, but sometimes it's inevitable.
ja_jp: 依存関係グラフの円形の依存関係。循環的な依存関係を持つことは、しばしば再設計を検討すべきであることを示していますが、時には避けられないこともあります。

source: Class Annotated With `@TemplateData`
ja_jp: `@TemplateData` でアノテーションされたクラス

source: Class Loading Reference
ja_jp: クラスローディングリファレンス

source: Class Preloading
ja_jp: クラスプリローディング

source: Class beans
ja_jp: クラスBean

source: Class generation uses the tool `protoc`, which is OS-specific. This is why we use the Nisse Maven plugin to target the executable compatible with the operating system.
ja_jp: クラス生成は `protoc` というツールを使用します。このため、Nisse Mavenプラグインを使用して、オペレーティングシステムと互換性のある実行可能ファイルをターゲットにしています。

source: Class generation uses the tool `protoc`, which is OS-specific. This is why we use the `os-maven-plugin` to target the executable compatible with the operating system.
ja_jp: クラス生成では、OS 固有のツール `protoc` が使用されます。このため、オペレーティングシステムと互換性のある実行可能ファイルをターゲットにするには、 `os-maven-plugin` を使用します。

source: Class metadata
ja_jp: クラスメタデータ

source: Class name of authentication plugin of the client.
ja_jp: クライアントの認証プラグインのクラス名。

source: Class-level security annotation must be placed on the class where the endpoint implementation is declared.
ja_jp: クラスレベルのセキュリティーアノテーションは、エンドポイント実装が宣言されているクラスに配置する必要があります。

source: Class-wide condition for build step with @BuildSteps
ja_jp: ビルドステップを @BuildSteps でクラス単位で条件指定する。

source: Class<?> objects
ja_jp: クラス<?> オブジェクト

source: ClassLoader Implementations
ja_jp: クラスローダーの実装

source: Classes and annotations are the primary source of bean-level metadata. The initial metadata are read from the _bean archive index_, an immutable https://github.com/smallrye/jandex[Jandex index, window="_blank"] which is built from various sources during <<cdi-reference.adoc#bean_discovery,bean discovery>>. However, extensions can add, remove or transform the metadata at certain stages of the bootstrap. Moreover, extensions can also register <<synthetic_beans,synthetic components>>. This is an important aspect to realize when integrating CDI components in Quarkus.
ja_jp: クラスとアノテーションは、Bean レベルのメタデータの主要なソースです。 初期のメタデータは、<<cdi-reference.adoc#bean_discovery,bean discovery>> の間にさまざまなソースからビルドされる不変の https://github.com/smallrye/jandex[Jandex インデックス, window="_blank"] である _Beanアーカイブインデックス_ から読み込まれます。 しかし、エクステンションは、ブートストラップの特定の段階でメタデータを追加、削除、変換できます。 さらに、エクステンションは <<synthetic_beans,synthetic components>> を登録することもできます。 これは、CDI コンポーネントを Quarkus に統合する際に実現すべき重要な側面です。

source: Classes and annotations are the primary source of bean-level metadata. The initial metadata are read from the _bean archive index_, an immutable https://github.com/wildfly/jandex[Jandex index, window="_blank"] which is built from various sources during <<cdi-reference.adoc#bean_discovery,bean discovery>>. However, extensions can add, remove or transform the metadata at certain stages of the bootstrap. Moreover, extensions can also register <<synthetic_beans,synthetic components>>. This is an important aspect to realize when integrating CDI components in Quarkus.
ja_jp: クラスとアノテーションは、Beanレベルのメタデータの主要なソースです。初期のメタデータは、Beanの link:cdi-reference.html#bean_discovery[ディスカバリ] 時に様々なソースから構築される不変の link:https://github.com/wildfly/jandex[Jandexインデックス, window="_blank"] である _Beanアーカイブインデックス_ から読み込まれます。しかし、エクステンションは、ブートストラップの特定の段階でメタデータを追加、削除、変換することができます。さらに、エクステンションは link:#synthetic_beans[合成コンポーネント] を登録することもできます。これは、CDIコンポーネントをQuarkusに統合する際に実現すべき重要な側面です。

source: Classes and annotations are the primary source of bean-level metadata. The initial metadata are read from the _bean archive index_, an immutable https://github.com/wildfly/jandex[Jandex index, window="_blank"] which is built from various sources during xref:cdi-reference.adoc#bean_discovery[bean discovery]. However, extensions can add, remove or transform the metadata at certain stages of the bootstrap. Moreover, extensions can also register xref:synthetic_beans[synthetic components]. This is an important aspect to realize when integrating CDI components in Quarkus.
ja_jp: クラスとアノテーションは、Beanレベルのメタデータの主要なソースです。初期メタデータは、Bean xref:cdi-reference.adoc#bean_discovery[ディスカバリー] 時に様々なソースから構築される不変の link:https://github.com/wildfly/jandex[Jandex] インデックスである _Bean archive index_ から読み取られます。しかし、エクステンションは、ブートストラップの特定の段階でメタデータを追加、削除、変換することができます。さらに、エクステンションは xref:synthetic_beans[合成コンポーネント] を登録することもできます。これは、QuarkusでCDIコンポーネントを統合する際に実現すべき重要な点です。

source: Classes from artifacts that extensions have marked as parent first (more on this later).
ja_jp: エクステンションが親優先とマークしたアーティファクトからのクラス (これについては後述します)。

source: Classes marked with `@ElasticsearchClientConfig` are made application scoped CDI beans by default. You can override the scope at the class level if you prefer a different scope.
ja_jp: `@ElasticsearchClientConfig` と書かれたクラスは、デフォルトでアプリケーション・スコープ付きのCDI Beanになります。異なるスコープを希望する場合は、クラスレベルでスコープを上書きすることができます。

source: Classes which contain build steps support the following types of injection:
ja_jp: ビルドステップを含むクラスは、以下のタイプのインジェクションに対応しています。

source: Classes which implement this interface are able to use additional annotations from Narayana to tell the STM subsystem about things such as whether a method will modify the state of the object, or what state variables within the class should be managed transactionally, e.g., some instance variables may not need to be rolled back if a transaction aborts. As mentioned earlier, if those annotations are not present then defaults are chosen to guarantee safety, such as assuming all methods will modify state.
ja_jp: このインターフェースを実装したクラスは、Narayana からの追加のアノテーションを使用して、メソッドがオブジェクトの状態を変更するかどうかや、クラス内のどの状態変数をトランザクション的に管理すべきか (例えば、トランザクションが中断した場合にロールバックする必要のないインスタンス変数があるなど) を STM サブシステムに伝えることができます。前述のように、これらのアノテーションが存在しない場合は、すべてのメソッドが状態を変更すると仮定するなど、安全性を保証するためにデフォルトが選択されます。

source: Classloading has a huge impact on your function execution time. This optimization allows preloading classes during the snapshotting process of SnapStart.
ja_jp: クラスローディングは、関数の実行時間に大きな影響を与えます。この最適化により、SnapStartのスナップショット処理中にクラスをプリロードすることができます。

source: Clean up by stopping the two services (`kill 2434984 2435130`).
ja_jp: 2つのサービスを停止してクリーンアップします( `kill 2434984 2435130`)。

source: Cleaned up navigation menu and made a no fuzz link:/get-started/["Getting Started"] section to show the absolute simplest set of steps to get started with Quarkus.
ja_jp: ナビゲーションメニューを整理し、Quarkusを使い始めるための絶対的にシンプルな手順を示した link:/get-started/["入門"] セクションを作りました。

source: Cleanup
ja_jp: クリーンアップ

source: Clear all application caches
ja_jp: すべてのアプリケーションキャッシュの消去

source: Clear site data
ja_jp: サイトデータのクリア

source: Clear the cookies in the browser, access the protected endpoint again and now you can observe an opaque `q_session` session cookie only:
ja_jp: ブラウザーのクッキーをクリアして保護されたエンドポイントに再度アクセスすると、不透明な `q_session` セッションクッキーのみが確認できます。

source: Clear-Site-Data header directives
ja_jp: Clear-Site-Data ヘッダーディレクティブ

source: Clearing of caches
ja_jp: キャッシュの消去

source: Clearing properties
ja_jp: プロパティーの削除

source: Click *Auth0 provider* followed by *Login into Single Page Application*:
ja_jp: *Auth0 provider*、*Login into Single Page Application* の順にクリックします。

source: Click on `Add` in that dialog without changing anything:
ja_jp: 何も変更せずに、そのダイアログで `Add` をクリックします。

source: Click on `Open Project`
ja_jp: `Open Project` をクリックしてください。

source: Click on connect
ja_jp: connectをクリック

source: Click on https://code.quarkus.io/?a=quarkus-getting-started-vertx&nc=true&e=rest-jackson&e=vertx[this link] to configure your application. It selected a few extensions:
ja_jp: アプリケーションを設定するには、 link:https://code.quarkus.io/?a=quarkus-getting-started-vertx&nc=true&e=rest-jackson&e=vertx[このリンク] をクリックしてください。 いくつかのエクステンションが選択されています：

source: Click on https://code.quarkus.io/?a=quarkus-getting-started-vertx&nc=true&e=resteasy-reactive-jackson&e=vertx[this link] to configure your application. It selected a few extensions:
ja_jp: https://code.quarkus.io/?a=quarkus-getting-started-vertx&nc=true&e=resteasy-reactive-jackson&e=vertx[このリンク]をクリックして、アプリケーションを設定してください。いくつかのエクステンションが選択されます。

source: Click on the Web Console link and log using `admin` and `password` default credentials. Quarkus has uploaded into the Schemas Tab the Protobuf Schema that is needed to marshall on the server the Greeting POJO with Protobuf. Check the xref:infinispan-dev-services.adoc[Infinispan Dev Services Guide] to learn more.
ja_jp: Web Consoleリンクをクリックし、デフォルトの認証情報である `admin` と `password` を使用してログインします。Quarkusは、Protobufを使用してサーバー上でGreeting POJOを変換するために必要なProtobuf SchemaをSchemas Tabにアップロードしました。詳細は、 xref:infinispan-dev-services.adoc[Infinispan Dev Services ガイド] を参照してください。

source: Click on the _Try me..._ buttons to check if your data is valid using one of the methods we presented above.
ja_jp: _Try me..._ ボタンをクリックして、上記で紹介した方法のいずれかを使用してデータが有効かどうかを確認してください。

source: Click on the `Generate your application` button, download the zip file and unzip it. Then, open the project in your favorite IDE.
ja_jp: `Generate your application` ボタンをクリックし、ZIPファイルをダウンロードして解凍します。その後、お好きなIDEでプロジェクトを開いてください。

source: Click on the `Provider: Keycloak` link and you will see a Keycloak page which will be presented slightly differently depending on how `Dev Services for Keycloak` feature has been configured.
ja_jp: `Provider:Keycloak` リンクをクリックすると、Keycloak ページが表示されます。このページは、 `Dev ServicesforKeycloak` 機能がどのように設定されているかによって少し異なります。

source: Click on the `Provider: Keycloak` link, and you will see a Keycloak page which will be presented slightly differently depending on how `Dev Services for Keycloak` feature has been configured.
ja_jp: `Provider: Keycloak` リンクをクリックすると、Keycloak ページが表示されます。このページは、 `Dev ServicesforKeycloak` 機能がどのように設定されているかによって少し異なります。

source: Click on the top menu `CREATE CREDENTIALS` > `OAuth client ID`:
ja_jp: トップメニューの `CREATE CREDENTIALS` > `OAuth client ID` をクリックします。

source: Click the **Provider: Keycloak** link within the **OpenID Connect** card in the Dev UI.
ja_jp: Dev UI の **OpenID Connect** カード内の **Provider: Keycloak** リンクをクリックします。

source: Click the *Keycloak provider* link. This action opens a Keycloak page whose appearance varies depending on how the Dev Services for Keycloak feature is configured.
ja_jp: *Keycloak provider* リンクをクリックします。 このアクションにより、Dev Services for Keycloak 機能の設定に応じて外観が異なる Keycloak ページが開きます。

source: Click the Swagger link and start testing the service.
ja_jp: Swagger リンクをクリックして、サービスのテストを開始します。

source: Clicking a page link inside a card navigates to a dedicated UI page for that feature. These pages can be bookmarked into the menu for quick access.
ja_jp: カード内のページリンクをクリックすると、その機能専用の UI ページに移動します。これらのページは、素早くアクセスできるようにメニューにブックマークできます。

source: Clicking it takes you directly to the Dev UI's Assistant panel, pre-filled with relevant error context. This allows the assistant to help you:
ja_jp: これをクリックすると Dev UI のアシスタントパネルに直接移動し、関連するエラーのコンテキストが事前入力されます。これにより、アシスタントは以下のことを支援できます:

source: Clicking on the CodeLens URL will open the URL in your default browser.
ja_jp: CodeLensのURLをクリックすると、デフォルトのブラウザでURLが表示されます。

source: Client
ja_jp: クライアント

source: Client API
ja_jp: クライアント API

source: Client Connection Configuration
ja_jp: クライアント接続の設定

source: Client Credentials Grant
ja_jp: クライアントクレデンシャル・グラント

source: Client Deadlines
ja_jp: クライアントのデッドライン

source: Client Interceptors
ja_jp: クライアントインターセプター

source: Client Priming
ja_jp: クライアント・プライミング

source: Client Secret JWT
ja_jp: クライアントシークレット JWT

source: Client Stub Deadlines
ja_jp: クライアント・スタブ・デッドライン

source: Client _priming_ is a technique that allows initializing a client during the snapshotting process, so it's already fully functional during the application runtime.
ja_jp: クライアントの _プライミング_ は、スナップショット処理中にクライアントを初期化し、アプリケーションの実行時にすでに完全に機能するようにする技術です。

source: Client authentication options
ja_jp: クライアント認証オプション

source: Client certificate
ja_jp: クライアント証明書

source: Client configuration
ja_jp: クライアント設定

source: Client configuration example
ja_jp: クライアント設定例

source: Client connectors
ja_jp: クライアントコネクター

source: Client credentials grant
ja_jp: クライアントクレデンシャル・グラント

source: Client endpoint
ja_jp: クライアントエンドポイント

source: Client endpoints
ja_jp: クライアントエンドポイント

source: Client endpoints are classes annotated with `@io.quarkus.websockets.next.WebSocketClient`. The value of `WebSocketClient#path()` is used to define the path of the endpoint this client will be connected to.
ja_jp: クライアントエンドポイントは、 `@io.quarkus.websockets.next.WebSocketClient` アノテーションが付けられたクラスです。 `WebSocketClient#path()` の値は、このクライアントが接続されるエンドポイントのパスを定義するために使用されます。

source: Client endpoints are used to consume and send messages. You'll need the <<client-connectors,connectors API>> to configure and open new WebSocket connections.
ja_jp: クライアントエンドポイントは、メッセージの受信と送信に使用されます。新しい WebSocket 接続を設定して開くには、<<client-connectors,connectors API>> が必要です。

source: Client id
ja_jp: クライアント ID

source: Client id and secret properties
ja_jp: クライアント ID およびシークレットプロパティー

source: Client intelligence
ja_jp: クライアントインテリジェンス

source: Client intelligence changes impact your performance in production. Don't change the client intelligence unless strictly necessary for your case. Read more in the xref:infinispan-client-reference.adoc[Infinispan Client extension reference guide].
ja_jp: クライアント・インテリジェンスの変更は、本番環境でのパフォーマンスに影響を与えます。 厳密に必要な場合を除き、クライアントインテリジェンスを変更しないでください。 詳細は xref:infinispan-client-reference.adoc[Infinispanクライアントエクステンションのリファレンスガイド] を参照してください。

source: Client lookup timeout (in milliseconds).
ja_jp: クライアント・ルックアップ・タイムアウト（ミリ秒）。

source: Client name
ja_jp: クライアント名

source: Client operation timeout (in milliseconds).
ja_jp: クライアント操作のタイムアウト（ミリ秒）。

source: Client proxies
ja_jp: クライアントのプロキシー

source: Client proxies allow for:
ja_jp: クライアントプロキシーは、以下のことを可能にします。

source: Client proxies only delegate method invocations. So never read or write a field of a normal scoped bean, otherwise you will work with non-contextual or stale data.
ja_jp: クライアントプロキシーはメソッドの呼び出しをデリゲートするだけです。そのため、通常のスコープされたBeanのフィールドを読み書きしてはいけません。

source: Client records information about the accessing client.
ja_jp: クライアントはアクセスしているクライアントに関する情報を記録します。

source: Client secret
ja_jp: クライアントシークレット

source: Client secret - use it if the HTTP `Authorization: Basic` client id and secret pair is expected
ja_jp: クライアントシークレット - HTTP `Authorization: Basic` のクライアント ID とシークレットのペアが期待される場合に使用します

source: Client secret credentials
ja_jp: クライアントシークレットクレデンシャル

source: Client secret value
ja_jp: クライアントシークレットの値

source: Client-initiated renegotiation allows a client to request new session parameters, such as a different cipher suite, during an established TLS connection. While this feature can provide flexibility, it also introduces a potential security risk when using TLS 1.2.
ja_jp: クライアント開始の再ネゴシエーションにより、クライアントは確立された TLS 接続中に、異なる暗号スイートなどの新しいセッションパラメーターをリクエストできます。 この機能は柔軟性を提供しますが、TLS 1.2 を使用する場合には潜在的なセキュリティーリスクも発生します。

source: Client-side field level encryption, and feature relying on https://github.com/mongodb/libmongocrypt[Mongo Crypt] in general, are not supported in native mode.
ja_jp: Client-Side Field Level Encryption、および一般に https://github.com/mongodb/libmongocrypt[Mongo Crypt] に依存する機能は、ネイティブモードではサポートされていません。

source: Client-side flow control window
ja_jp: クライアント側フロー制御ウィンドウ

source: Clients can be configured in `application.properties` file using `authPluginClassName` and `authParams` attributes:
ja_jp: クライアントは、 `authPluginClassName` および `authParams` 属性を使用して `application.properties` ファイルで設定できます。

source: Clients can specify the fully qualified service name to get the health status of a specific service or skip specifying the service name to get the general status of the gRPC server.
ja_jp: クライアントは、特定のサービスのヘルス状態を取得するために完全修飾されたサービス名を指定したり、gRPCサーバーの一般的な状態を取得するためにサービス名の指定を省略することができます。

source: Clients can:
ja_jp: クライアントで以下のことが可能になりました。

source: Clock skew in seconds used during the token expiration and age verification. An expired token is accepted if the current time is within the number of seconds specified by this property after the token expiration time. The default value is 60 seconds.
ja_jp: トークンの有効期限と年齢確認時に使用されるクロックスキュー（秒）。トークンの有効期限切れ後、現在時刻がこのプロパティで指定された秒数以内であれば、期限切れのトークンは受理されます。デフォルト値は60秒です。

source: Clone the Git repository by running the `git clone {quickstarts-clone-url}` command. Alternatively, download an {quickstarts-archive-url}[archive].
ja_jp: `git clone {quickstarts-clone-url}` コマンドを実行して Git リポジトリをクローンします。あるいは、{quickstarts-archive-url}[archive]をダウンロードしてください。

source: Clone the Git repository:
ja_jp: Gitリポジトリのクローンを作成します:

source: Clone the Git repository: `git clone https://github.com/amqphub/quarkus-qpid-jms-quickstart.git`, or download an https://github.com/amqphub/quarkus-qpid-jms-quickstart/archive/main.zip[archive].
ja_jp: Git リポジトリをクローンします。 `git clone https://github.com/amqphub/quarkus-qpid-jms-quickstart.git` または link:https://github.com/amqphub/quarkus-qpid-jms-quickstart/archive/master.zip[アーカイブ] をダウンロードします。

source: Clone the Git repository: `git clone {quickstarts-clone-url}`
ja_jp: Gitリポジトリをクローンする: `git clone {quickstarts-clone-url}`
